Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 다음에도 이렇게 놀자!
en_us: let’s hang out like this again next time!

source: 야, 윤시아!
en_us: hey, sia!

source: 아무래도 정황상...
en_us: but it seems like...

source: 새로운 반응이 없나...
en_us: any new reactions?

source: 넌 변하고 싶다는 의지가 정말 크잖아.
en_us: you have a very strong desire to change.

source: 아빠 아는 애니?
en_us: do I know him?

source: 난 악착같이 돈을 모을 거야.
en_us: I’m going to earn as much money as I can.

source: 끼익~
en_us: CREAK

source: 김민호가 좋아하는 걸 해보기로 한 날이니까!!!
en_us: ...to do something that minho likes today anyway!!!

source: 어어!?
en_us: huh?!

source: 방학 동안 결국 얼굴 한 번 못 봤네.
en_us: I didn’t get to see him during vacation at all.

source: 자, 이제 마저 장 보자!
en_us: let’s get the rest of our groceries now!

source: 시작부터 너무 무리하려 하지 마,
en_us: don’t overexert yourself from the start.

source: 슬그머니…
en_us: TIP TOE

source: 나 학원가야 하는데...
en_us: but the academy...

source: 윤시아 그 녀석!!
en_us: sia?!

source: 김민호가 나보다 더 인기 많은 거야!!??
en_us: minho’s more popular than I am?!!!

source: 그, 그럼...!
en_us: th-then...!

source: 으아아앙
en_us: WAAAAAH

source: 내 셀카가 초라해보여...
en_us: ...my selfie looks so shabby.

source: 깜짝이야, 야!
en_us: geez! you scared me!

source: 야
en_us: L

source: <큐브 몬스터>가 무엇인지 보여주지!!!
en_us: ...to show you what cube monster really is!!!

source: 그래도…
en_us: still...

source: 저 녀석들은...!
en_us: those guys...

source: 에, 에엣…!?
en_us: h-huh?!

source: 너야말로 놀 줄 아는 걸?
en_us: but I didn’t expect you to sing a bop like this either.

source: 그래, 맞아…
en_us: that’s right...

source: 왜 이렇게 긴장하고 있어~
en_us: why are you so nervous?

source: 이런게 재밌나?
en_us: how is this kind of thing any fun?

source: 같이 뉴튜브 찍을 수 있는 거지?
en_us: film newtube videos with you, right?

source: 역시 초반이라 그런가 살이 쭉쭉 빠지는군,
en_us: he’s losing weight really fast because it’s early on.

source: 정말 같이 놀 사람이 없는걸...
en_us: ...I really have no one to hang out with.

source: 모르는 사람이 봤을 때 난 아직 뚱뚱하구나…
en_us: I must still look fat to people who don’t know me...

source: 긍정적인 응원의 댓글들이 반겨주었다.
en_us: ...and showered with encouraging comments.

source: - 초코리타 넌 내꺼야!
en_us: Chocorita, you’re mine!

source: 상상 그
en_us: Enjoy more

source: 저 친구는 왜 시키지도 않은 유산소를 하고 있니...?
en_us: why is that kid doing cardio when no one told him to?

source: 이건 시작조차도 못 할 게임이야.
en_us: this isn’t a game you can just start.

source: 올해의소녀?
en_us: generation of girls?

source: 니가 왜 여기서 나와…?
en_us: what is he doing here?!

source: 뉴튜브 꼭 해야 해?
en_us: do you have to keep doing newtube?

source: 후따리~
en_us: futari~

source: 허얼
en_us: UGH

source: 울망...
en_us: TEARY

source: 킁킁
en_us: SNIFF SNIFF

source: 포기가 안 되더라...
en_us: ...made me want to try.

source: 그치만~ 네가 좋은 걸 어떡하닝?
en_us: but I can’t help it! I like you toooo much!

source: 어, 그게…
en_us: uh, well...

source: 학원은 무슨!
en_us: forget the academy!

source: 빨리 오든가~
en_us: hurry up, then!

source: 이 새X가 미쳤나, 이거.
en_us: this son of a b*tch!

source: 왜 여기에!!!!
en_us: is he here?!!!

source: 시아쨩...
en_us: sia-chan...

source: 그게 뭐냐면...
en_us: it’s about...

source: 대신 본격적인 참여는 겨울 방학부터 가능해, 괜찮지?
en_us: but I can’t join full-on until winter break. is that all right?

source: 민하?
en_us: minha?

source: 갑자기 누가 아프다거나, 부모님의 반대라거나...
en_us: did someone suddenly fall ill? or did your parents oppose her?

source: 그럼 이만 쉬자~
en_us: let’s take a break, then.

source: 뿅
en_us: POOF

source: 아프겠다..
en_us: that has to hurt...

source: ingstargram
en_us: instargram

source: 안녕~
en_us: hi!

source: 크리스마스에 가족들이랑 보내는 것 만큼...
en_us: spending christmas at home with family...

source: 너 왜 누나 친구한테 막말해!!
en_us: how dare you call my friend a pig!!!

source: 헐..
en_us: WOW

source: 고인순
en_us: Insun Go

source: 당연히 모를 줄 알았는데.
en_us: I thought you wouldn’t.

source: 반짝 뜨는 거 보다 나처럼 롱런하는게 더 중요한 거야, 멍청아~
en_us: going for the long run like me is a lot more important than suddenly rising to fame, dummy.

source: 그, 그렇단건...
en_us: s-so... are you saying...

source: 내일 쉬는 날이잖아, 내일 뭐해?
en_us: tomorrow’s your rest day. what are you going to do?

source: 조회수 21만회 2주 전
en_us: 210k views 2 weeks ago

source: 뭐, 뭐야...
en_us: wh-what the...

source: 도대체 머리는 왜 올리는 거야?
en_us: why the heck did you wax your hair?

source: 저… 붕어빵 슈크림 하나 팥 주세요
en_us: excuse me... I’d like one choux cream and one red bean paste bungeo-ppang.

source: 만식이랑 난 비슷한 시기에 뉴튜브를 시작해서 친해졌어!
en_us: mansik and I got close because we started our channels around the same time!

source: 두리번 두리번
en_us: TURN TURN

source: 윤시아!
en_us: sia!

source: 분위기 진짜 험악하던데…
en_us: things looked really serious...

source: SUT**님이 팔로우함
en_us: Followed by SUT**

source: 네가 최고야!!
en_us: you’re the best!!

source: 갑자기 왜!
en_us: why?!

source: 펑!
en_us: POP

source: 콘텍트렌즈
en_us: CONTACT LENSES

source: 곡 다이브-twelve
en_us: ong DIVE-twelve

source: 윽..
en_us: ERGH

source: 인
en_us: NS

source: 얘 이러다가 헬스 중독 되는 거 아냐...?
en_us: what if he turns into a gym addict?

source: 열심히 잘 하고 있는 것만 알았지, 굶어가면서까지 할 줄은 누가 알았겠냐고…
en_us: he was following the program really diligently, so I never thought he’d starve himself in the process...

source: 혼자 고생하는 김민호를 볼 때면…
en_us: seeing minho struggle like this by himself...

source: 시아쨩...!!
en_us: sia-chan!!!

source: 목소리가 워낙 좋으니까 진짜 가수 같더라~
en_us: your voice is so pretty... you sounded like a real singer!

source: 그럼 너는 학원 같은 거 안 다녀?
en_us: don’t you go to any academies?

source: 우 우왕아
en_us: W Wangah 12 hours ago

source: 전력 케이블 매장
en_us: Electronics & Cables

source: 밥 해줘~
en_us: can you cook now?

source: 다이어트 방법이 지금 오빠한텐 너무 가혹한 것 같아서요.
en_us: ...but I think the current diet is too difficult for my brother.

source: 우욱…
en_us: uuugh...

source: ㅋㅋㅋㅋㅋ
en_us: hahahaha!

source: 너굴맨
en_us: Seafood Noodles

source: 너도 날 믿어줬는데, 나도 널 믿어야지.
en_us: you trusted me, so of course I should trust you.

source: 나한테 중요한 건 조회수니까!
en_us: what’s important is the view count.

source: 크리스마스에 단둘이 만나 쇼핑도 하고,
en_us: it’s christmas! and it’s just us two!!!

source: 먹을 거라곤 라면이랑 탄산뿐...
en_us: the only food here are instant noodles and soda...

source: 아직 차였다고는 안 했는데...
en_us: I didn’t say I was dumped...

source: 차라리 굶는 게 나을 것 같아서…
en_us: so I thought it’d be better to not eat...

source: 그치만...
en_us: but...

source: 운동은 당연히 안 할 거고.
en_us: I’m sure he doesn’t exercise.

source: 에…
en_us: uh...

source: 그땐 가만 안 둘 거니까.
en_us: ...I’m going to have your heads.

source: 귀여운 강아지를 산책 시키는 사람들,
en_us: others walk cute dogs.

source: 이러는 이유가 있을 거 아니니~
en_us: there must be a reason why~

source: 여기 김민호 있냐?
en_us: is minho kim in here?

source: 이, 이게 맞아, 만식아...?
en_us: a-am I doing this right, mansik?

source: 우린 떡볶이나 먹으러 가자!
en_us: let’s go eat tteokbokki!

source: 나 더 이상은 무리야...!!
en_us: I can’t... do any more!!!

source: 후후후, 이번 기회로
en_us: hehehe, I’ll take this opportunity...

source: 아, 아리가토...
en_us: a... arigato (thank you)...

source: 쿠구궁
en_us: DOOM

source: 계속 메인에 떠 짱나게
en_us: I hate that she keeps popping up on my homepage.

source: 우린 이쪽!
en_us: we’re going this way!

source: 요즘 핫하던뎅
en_us: everyone seems to be watching that one.

source: 뉴튜브를 하게 되면 분명 욕도 많이 먹을거니까 겁나고 두려웠고...
en_us: if I show myself on newtube, people would criticize me... I was scared of that.

source: 장, 장난이지?
en_us: y-you’re... kidding, right?

source: 네, 네엥...
en_us: y-yes, ma-am...

source: 민호의 고백은 그렇게 허무하게 끝이났다.
en_us: like that, minho’s confession ended in utter failure.

source: 맞구나...!
en_us: it was you!

source: 어엿한 고등학생이 되었다.
en_us: ...and was now a big high schooler.

source: 내가 운동 조금 한다고...
en_us: will exercising like this...

source: 시원이는 오늘도 빛이 나네요!
en_us: siwon is dazzling today again, as always!

source: 달그락
en_us: CLATTER

source: 오빠, 나 왔어~
en_us: minho, I’m back!

source: 계란도 다 떨어져서 사야 해.
en_us: we need to get eggs, too.

source: 어떤게 있을까…
en_us: ...minho like?

source: 민호만 계속 고생시키는 기분...
en_us: I am putting him through a lot of trouble...

source: 마지막에 이 글은 굳이 왜 적었냐고.
en_us: ...but why did you have to add this last sentence?

source: 그런데 아까부터 쟤는 왜 저러고 있담?
en_us: but what’s wrong with her?

source: 하하
en_us: haha

source: 나보고 뭐 어쩌라구...
en_us: what am I supposed to do...?

source: 하아아...
en_us: haaa...

source: 이렇게 허무하게 끝이 나다니...
en_us: ...came to such a futile end.

source: 싫긴 하지만…
en_us: I don’t like it at all...

source: 몰라?
en_us: I dunno.

source: 저, 저기 그… 큐브 몬스터란거… 그냥 아동 만화 아니었어?
en_us: w-well... uh... wasn’t this cube monster thing... just a children’s cartoon?

source: 굳이 또 다른 운동을 해야해?
en_us: do I really have to work out more?

source: 나 김치찌 시켜 먹을 건데 같이 먹자.
en_us: I’m ordering steamed kimchi stew. let’s have some together.

source: 그렇지…
en_us: he did...

source: 시텔
en_us: Rooms

source: 이런 띵곡을 부르다니.
en_us: you’re awesome!

source: 시아
en_us: Sia

source: 백시원, 강보배가 여길 왜 같이...!
en_us: what are siwon and bobae doing here together?!

source: 나를 궁금해했다고!?
en_us: ...wants to get to know me?!

source: 그때 딱 한 번 그런 건데!ㅠㅠ
en_us: it was only once! sniffle...

source: 어째서!?
en_us: how come?!

source: 너무 불쌍하잖아, 내 친구!!
en_us: I feel so bad for my friend!!

source: 뉴튜버 윤시아라고~!!
en_us: of all dara high school students, I rank in the top 1% for the number of subscribers!!!

source: 이 옷도 아냐,
en_us: no, not this.

source: 의 역습
en_us: Setkichu’s Revenge

source: 치카치카
en_us: BRUSH BRUSH

source: 허허허, 그래 그래~
en_us: hohoho, there, there.

source: 그건, 그냥...
en_us: that... was only because...

source: 고생했어, 시아짱~
en_us: you did well, sia-chan.

source: 사뿐 사뿐
en_us: STEP STEP

source: 괜히 헛수고만 하고 있는 걸까봐...
en_us: ...but I’m worried it might all be for nothing.

source: 저 녀석들이...
en_us: how dare those jerks...

source: 이번에 포기하면 시아쨩 옆엔 영영 서보지도 못 할 거라고 생각하니까
en_us: the thought of never having the chance to be by your side if I don’t do this...

source: 등교준비를 마치면,
en_us: once I finish getting ready for school...

source: 괜히 이렇게 써서 싸운거 아니냐며 애들이 수근 거리는 거 아니야.
en_us: the kids are gossiping even more because of it. they think you two fought.

source: 용 조명등
en_us: y Flashlights

source: 하면 되잖아, 여태 왜 안 했어~!!
en_us: I knew you could do it! why didn’t you start sooner?

source: 꺄아~~!!
en_us: kyahhhh!!

source: 난 좀 더 독해질 필요가 있어!!!
en_us: I need to take things a step further!!!

source: 딱 보면 몰라!?
en_us: isn’t it obvious?!

source: 민호는 자신의 식단에 의문을 품기 시작했다.
en_us: ...minho began questioning his meal plan.

source: 쿄
en_us: KO

source: 주룩
en_us: DRIP

source: 그렇다면 좋기는 한데...
en_us: that sounds nice, but...

source: 볼 만했어.
en_us: it was okay.

source: ㅂㄷㅂㄷ
en_us: TREMBLE TREMBLE

source: 아, 네~
en_us: yes, ma’am.

source: 왼손으로 쓴 거야?
en_us: did they write this with their other hand?

source: 할 수 있어~~
en_us: you can do it!

source: 내가 좀 심했던 거 같긴 해...
en_us: I think I was too hard on him...

source: 비틀 비틀
en_us: STAGGER STAGGER

source: 완전 감동!
en_us: I’m so moved!

source: 발그레…
en_us: BLUSH

source: 대림 부동산
en_us: Daerim Realty

source: [만식쿤] 호칭 획득!
en_us: obtained the nickname [mansik-kun]!

source: 텅
en_us: THUNK

source: 후우… 후우…
en_us: whew... whew...

source: 빨리 채워넣고 싶어...
en_us: I want to write down tons of notes already...

source: 공부에 집중하고 싶기도 하고...
en_us: I want to focus on studying...

source: …뭐?
en_us: what?

source: 그나저나 온바디는 어떻게 나왔어?
en_us: anyway, what are his numbers?

source: 친하게 지내자!
en_us: let’s be friends!

source: 그, 그런 건 아닌데…
en_us: n-no... she didn’t...

source: 윤시아, 너 괜찮냐?
en_us: sia, are you okay?

source: 초-인싸들의 전유물인 셀카 어플을...
en_us: ...I’ll use the selfie app that’s only for the in-crowd.

source: 오, 오빠가 집에 여자를!!!??
en_us: m-minho... brought a girl home?!!!

source: 1일차
en_us: Day 1

source: 응원합니다!!!
en_us: I’m rooting for you!!!

source: 이러면 구독자 100만 못 가!
en_us: I won’t hit a million subs like this!

source: 민호쿤 인기 장난 아니던걸!?
en_us: minho-kun! you’re so popular!!!

source: 고, 고마워...
en_us: th-thanks...

source: 또 멍때리다가 다시하게 만들지 말구!
en_us: don’t go blank on me again and make me start over.

source: 허억 허억
en_us: PANT PANT

source: ㅎㅎ~
en_us: HEHE

source: 내가 김민호 괴롭히지 말랬지!
en_us: I told you! don’t bully minho!

source: 말도 안돼...
en_us: no way...

source: 랑북
en_us: tortle!

source: 최만식이 칼을 갈고 있을 줄은…
en_us: ...what mansik had in store for him.

source: 촛불에 꽃다발에...
en_us: candles and a bouquet...

source: 화장대에 앉아 기초 화장을 한다.
en_us: ...and goes through her morning skincare routine.

source: 계좌이체 되는디?
en_us: you can pay by electronic deposit.

source: 프로젝트에 참여할게...!!
en_us: I want to join that project!!!

source: 시원이 같은 훈남이 왜 날 두고 너 같은 코딱지랑 사귀고 있는지 모르겠네~
en_us: I just don’t understand why a hunk like siwon is dating a little booger like you instead of me.

source: 연락하지마!
en_us: don’t ever contact me again!

source: 그런데 뭐지...
en_us: why...

source: 계속 떨어지네..
en_us: they keep unsubbing...

source: 온 가족이 모여 앉아 밥을 먹는 이 분위기…
en_us: ...since I’ve had dinner with so many people.

source: 뭐, 뭐어...?!
en_us: wh-whaaat?!

source: 주섬 주섬
en_us: FUMBLE FUMBLE

source: 그런데 둘이 어디서 한 번 본 적 있어?
en_us: but did you guys meet before?

source: 학교에선 1학년 일진 무리를 이끄는 양아치 중에서 쌩양아치..!!
en_us: she also leads the entire pack of first-year bullies while being the meanest one of them all!

source: 최애 애니메이션의 새로운 시즌이 시작되었기 때문!
en_us: ...a new season of his favorite anime started today!

source: 이게, 진짜!!
en_us: you little-!

source: 치, 친구 만나기로 했어!
en_us: I-I’m meeting up with a friend!

source: 헤에-
en_us: HEHE

source: 하여간 그 ㄴ 내가 언제 한 번 족칠 거야!!
en_us: dammit! I’m going to get back at that b*tch someday!!!

source: 자, 잠깐!
en_us: w-wait!

source: 아까부터 성환쿤 성환쿤, 그게 대체 누군데!
en_us: seonghwan-kun? who the heck is that?!

source: 그건 그러네…
en_us: he has a point...

source: 오늘은 시아쨩이랑 같이 밥 먹기로 한 날이라서…
en_us: I agreed to eat with sia-chan today...

source: 근력운동이 제일 재미없어!
en_us: strength training is so boring!

source: 프
en_us: MP

source: 호오~
en_us: oho~

source: 나코쨩이 나온건 3세대부터지만 말이야…
en_us: although nako-chan first appeared in the third...

source: 18화
en_us: Episode 18

source: 남의 말투까지 고치라고 강요할 순 없으니…
en_us: ...but I can’t force someone to change how they talk.

source: 아메리카노 1500원
en_us: AMERICANO $1.50

source: 나랑 노는게 재미 없다 이거지!?
en_us: so you’re saying I’m no fun?!

source: 백시원 의문의 1패
en_us: 1 loss for siwon

source: 아아, 그게~ 쟤가 너 몰래 햄버거 먹으려고 하는 걸 막은 적 있거든~
en_us: well... because I stopped him from eating a hamburger in secret!

source: 엄청나게 오고 싶구나!!!!
en_us: he really, really wants to come over!!!!

source: 솔직히 자신 없어...
en_us: honestly, I don’t think so...

source: 어딜~
en_us: no way!

source: 후~ 하~
en_us: WHOO~ HAA~

source: 조회수 159만회 1일 전 인기 급상승 동영상 #!
en_us: 1.59M views 1 day ago Top trending video

source: 너 미쳤어!?
en_us: that’s absurd!!!

source: 너 지금 조회수 160만의 주인공인 김민호를 무시하는 거야?
en_us: are you looking down on minho right now? when he’s getting 1.6 million views?

source: 뭐…
en_us: what...

source: 슉
en_us: WHISH

source: 그런 위기의 순간마다 날 지켜주는 친구가 있었는데...
en_us: but I had one friend who always came to the rescue.

source: 왁 왁 왁
en_us: YELL YELL YELL

source: 좋다 좋다, 뉴튜브 각인데?
en_us: yeah, let’s do that. it’ll be great for newtube too!

source: 성환킁~~!!!!
en_us: seonghwan-kun!!!!

source: 맛있겠다아~~~!!
en_us: it looks so yummyyyy!!!

source: 윽...
en_us: EWW

source: 어허!
en_us: oh, no, no!

source: 걔도 네가 원하는 걸 해주고 있으니까,
en_us: since he’s doing something that you wanted...

source: 속닥
en_us: WHISPER

source: 하하…
en_us: haha...

source: 쭈~욱!!!!
en_us: absolutely nothing!!!!

source: 몸이 변화에 적응을 해버려 감량이 더뎌진 거지.
en_us: ...your body adjusted to the change, slowing down the weight loss.

source: 너가 그 애가 맞는지...
en_us: I wasn’t sure if you were her...

source: 자신있어?
en_us: feeling confident?

source: 쌉찰랑 12시간 전
en_us: Lovely Me 12 hours ago

source: 노래 번
en_us: Song: Burn

source: 시아쨩 방은 변한 게 없구나?
en_us: sia-chan, your room hasn’t changed one bit!

source: 엣...
en_us: eh...

source: 시아가 집으로 온단 말이야!!!
en_us: ...sia will be here!!!

source: 생각보다 잘 어울리네…
en_us: better than I thought...

source: 아빠랑 삼촌이 자그마한 도장을 운영하면서 말야.
en_us: ...went toward her hospital bills.

source: 22화
en_us: Episode 22

source: 나도 운동은 취미라서 가르칠 땐 미숙한 점이 많거든
en_us: exercise is just my hobby, so I’m not the greatest at teaching.

source: 김민호가 좋아하는 거…?
en_us: something minho likes?

source: 그냥...
en_us: I just asked...

source: 그냥 시키는대로 하자!!!
en_us: I’ll just do what he says for now!!!

source: 히익!
en_us: GASP

source: 응, 그러니까 많이 먹이려고 하면 안 돼.
en_us: yeah, so don’t tell him to eat a lot.

source: 점심 먹었니?
en_us: have you had lunch?

source: 진짜...?
en_us: really?

source: 퍼억!
en_us: THWACK

source: 에에...
en_us: uh...

source: 야, 왜긴 왜야.
en_us: what do you mean, why?

source: 당연한 거고...
en_us: only natural...

source: 어디서 감히 김민호로 조회수 꿀 빨려고…
en_us: how dare you try to leech off of minho for views?!

source: 다음 영상은 뭐야?
en_us: what’s your next vid going to be about?

source: 그게 뭔데?
en_us: what is it?

source: 변하고 싶다는 의지가 크기 때문에…!!!
en_us: ...is greater than my desire to eat!!!

source: 그만큼 평소 생활 습관이 최악이었단 거지...
en_us: although that means he lived an absolutely horrible lifestyle...

source: 뉴튜브를 계속 해야하는 이유...?
en_us: why do I have to keep up the channel?

source: 나 뉴튜브 찍는 거 도와주시기도 하고.
en_us: and helps me film my videos.

source: 바람폈나?
en_us: did one of them cheat?

source: 배꼽시계야~!!!!!!!!!
en_us: ...my trusty stomach!!!!!!!!!

source: #냉동식품 #PX추천
en_us: #frozenfoods #PXhaul

source: 야, 윤시아 백시원이랑 헤어졌다며?
en_us: hey, did you hear? sia and siwon broke up.

source: 좋아요 8905개
en_us: 8905 likes

source: 운영시간 7:00
en_us: Open Hours 7:00

source: 아마 전부 참여하긴 힘들 것 같아.
en_us: probably won’t be able to attend any of it.

source: 스
en_us: tsu

source: 베지밀 매일두유
en_us: VeggieMilk Soy Milk

source: 아침 고구마 1개 저지방 우유 사과
en_us: Breakfast 1 sweet potato Low-fat milk Apple

source: 내가 정말 이 녀석을 잘생겨지게 만들 수 있을까?
en_us: ...can I really turn this kid into a handsome man?

source: 흠칫
en_us: FLINCH

source: 곧 50만 구독자인데...
en_us: we’ll hit half a million subscribers soon...

source: 킹카가 된다고...?
en_us: ...can become a stud?

source: 돈까스
en_us: Donkatsu

source: <큐브 몬스터>를 열심히 즐겨주고 있어…
en_us: ...enjoying cube monster with me...

source: 후후…
en_us: hehe...

source: 이젠 꿈에 안 나오잖아.
en_us: she doesn’t show up in my dreams...

source: 나 괜찮은데…
en_us: I feel fine...

source: 이잉
en_us: AWWW

source: 와 나 얘 고딩때 가족들이랑 티비에서 본 거 같은데 개 예쁘게 자랐다ㅋㅋㅋ
en_us: Wow, I saw her on TV with my fam when I was in high school. She grew up to be so pretty lol

source: 민호 집
en_us: minho’s house

source: 으음..
en_us: um...

source: 알고 있던 맛이 더 그립다더니…!
en_us: especially because I know what they taste like!

source: 도대체 어떤 운동을 하길래...
en_us: what kind of workout is he doing?

source: 그럼, 한 가지 테슽트 해야 할 게 있는데...
en_us: then, there’s one thing I need to test...

source: 그게 누군뎁쇼?
en_us: who’s that?

source: 크읏
en_us: SNIFFLE

source: 야, 윤꽃분 떴다!!!
en_us: hey, daisy’s here!!!

source: 그건 말이다…
en_us: you see...

source: 멋있다 ㅎㅎ…!
en_us: how cool, haha...

source: 귀도리라고 부르는 거구나
en_us: so that’s what they’re called...

source: 가맹점문의 0*-8**7-1**5
en_us: Franchise Inquiries 0*-8**7-1**5

source: 얘 뭐야, 진짜!!
en_us: what’s wrong with him?!

source: 힘들긴 한데...
en_us: even though it’s difficult...

source: 잠깐만...!
en_us: hold still!

source: 하아…이제야 끝났다…
en_us: ha... it’s finally over...

source: 마, 맞다…!
en_us: I-I forgot!

source: 난 이제 쉴게~
en_us: I’m going to take a break.

source: 신비로
en_us: Myster

source: 너의 시대는 끝났다!
en_us: it’s over for you!

source: 성큼 성큼
en_us: STRIDE STRIDE

source: 자아...
en_us: okay...

source: 후우…지친다.
en_us: whew... I’m exhausted.

source: 무서워!!!
en_us: that’s scary!!!

source: 난 신경쓰지말고 먼저 들어가봐~
en_us: don’t worry about me and go home.

source: 우웅
en_us: VRRR

source: 그래, 그럼 이제 너희들도 한 곡씩 해~
en_us: okay, then. you two sing a song each now.

source: 따끈따끈 황금 붕어빵!
en_us: Warm, Golden Bungeo-ppang

source: 여자들에게 차인 숱한 기억들...!!
en_us: got rejected by girls countless times

source: 다음에 마주치면 진짜 죽여버린다고.
en_us: next time, I’m really gonna kill her.

source: 역시 우리의 동지!
en_us: he’s definitely our comrade!

source: 우아아… 진빠져…
en_us: ugh... I’m drained...

source: 나 심심해서 죽는 줄 알았자나~
en_us: I was bored to death waiting!

source: 우리들의 본질은 오타쿠야!
en_us: and we’re otakus!

source: 사랑과 꿈을 키워가
en_us: Teaching With Love

source: 시간이 꽤 흘러,
en_us: a lot of time passed...

source: ㅠㅠ~
en_us: boohoo!

source: 투닥 투닥
en_us: BICKER BICKER

source: 오이오이~ 민호킁~!!!
en_us: oy, oy! minho-kun!!!

source: 멋있지 않아!?
en_us: doesn’t it look good?!

source: 크리스마스까지 이 지긋지긋한 오타쿠랑 놀라고?
en_us: no way I’d spend christmas with this nerdy otaku!

source: 우웅…
en_us: okay...

source: 난 몰랐지...
en_us: I didn’t know...

source: 어째서 이딴 놈들한테 험한 소리나 듣고 있는 거야...!!!!
en_us: she doesn’t deserve to hear any of this from these scumbags!!!!

source: 다이어트를 변함없이 했기 때문이야.
en_us: ...is because you haven’t changed your dieting routine.

source: 빨리 통과됐으면 좋겠다...
en_us: I hope I pass soon...

source: 나 테스트는 통과된 거야?
en_us: did I pass the test?

source: 계속 잠수만 탔다간 팔로워수도 뚝뚝 떨어지겠지...?
en_us: if I don’t post another video soon, everyone might unsubscribe...

source: 프사 내렸네 무슨 일 잇어???ㅠㅠ
en_us: ur profile pic is gone. what happened??? :(

source: 어차피 많이 먹지도 못 할 걸?
en_us: besides, he probably won’t be able to eat much...

source: 의성
en_us: Blood Donations

source: 화악
en_us: RUSH

source: 큭, 젠장
en_us: ugh, shoot...

source: 3일 후에 또 몸무게 체크야...
en_us: we’re checking your weight in three days.

source: 무화과를 잔뜩 얹었어요.
en_us: I put tons of figs on it.

source: 이 정도일 줄은 몰랐어요...
en_us: but I didn’t know it was this bad...

source: 추가 ㅡ 쌍자음
en_us: [→] .,?! [↑] space

source: 처억!
en_us: FLICK

source: 에에엑!!!!
en_us: whaaaat?!?!

source: 아, 좀만 쓰다 줄게~
en_us: geez, let me use it for just a bit!

source: 특별한 서프라이즈를 준비하도록 해라!
en_us: prepare a very special surprise for her!

source: 자, 잠깐…
en_us: w-wait...

source: 그나저나 이렇게 열심히 따라주니까 조금 미안하네...
en_us: at any rate, I feel kind of bad that he’s following along so well...

source: 인형뽑기
en_us: CLAW MACHINES

source: 뭐야, 김민호…
en_us: wow, minho...

source: 우헤헷~
en_us: HEHEHE

source: 고개 더 숙이고~
en_us: bring your chin down a bit!

source: 쉬넬 치킨
en_us: Yummy Chicken

source: 바랐었는데...!!
en_us: that’s what I had hoped!!!

source: 안 먹어서 그런가… 너무 힘들어…
en_us: ...but I’m so tired... is it because I didn’t eat?

source: 개-운
en_us: WOOHOO

source: 헐~ 너 친구도 있구나?
en_us: whoa... you have friends?

source: 그만큼 본판이 좋아야 되겠지만~
en_us: though they had good-looking faces to begin with.

source: 쿵짝
en_us: BA-DUM

source: 아참, 민호야.
en_us: oh, right. minho.

source: 아무래도 요즘 근력운동 없이 다이어트해서 근손실도 좀 있었을 거야.
en_us: he probably lost some recently because he followed a minimal meal plan without any strength training.

source: 야매로!!
en_us: yamero (stop)!!!

source: 그렇게 조롱하고 비웃는다고…?
en_us: but is this just a joke to them? something to ridicule?

source: 헐, 대박...
en_us: whoa...

source: 청춘헬스장
en_us: Gym of Youth

source: 진짜 걱정된다...
en_us: ...worry me.

source: 벌써!!??
en_us: already?!

source: 뭔가 안 꾸민 느낌…
en_us: ...but it looks like you just wore the first thing you grabbed...

source: 나 한다면 하는 사람이라구!
en_us: I always keep my word, you know!

source: 4개 이상
en_us: 4 more

source: 괜히 미안하네...
en_us: I feel bad...

source: 저 녀석이...
en_us: but why...

source: 잊기로 했잖아!
en_us: you decided to forget about her!

source: 하마터면 군것질을 할 뻔 했다구우…!
en_us: I almost binged on a snack...

source: 조용히 안해!?
en_us: be quiet!

source: 웅웅!!
en_us: yeah!

source: 알겠니, 김민호!?
en_us: got it, minho?!

source: 시아루~ 정말 오랜만이죠?
en_us: hey, sialoves! long time no see, right?

source: 목표했던 조회수보다 더 나왔어!!
en_us: we got more views than what we aimed for!

source: 어디, 어디!!!
en_us: where, where?!

source: 다들 민호에게 작별인사 전화라도 해주거라~
en_us: everyone should call him and say goodbye.

source: 아, 네 대표님.
en_us: oh, yes, sir.

source: [MAKE UP] 쉽게 배우는 시아의 등교 메이크업
en_us: [MAKEUP] Sia’s Easy School Makeup

source: 살을 왕창 빼고 꾸며놔도 그저 그럴 수도 있잖아.
en_us: even if he loses all that weight, he might be just mediocre.

source: 아아- 그 프로젝트 아직도 하고 있는 거였냐...
en_us: oh... that project isn’t over yet?

source: 새벽 2:00
en_us: 2:00 AM

source: 걔 완전 미쳤다니까!
en_us: he was totally nuts!

source: 조잘
en_us: CHATTER

source: 자아~
en_us: ready?

source: 저 밑에 사진은 뭐야?
en_us: what’s that picture?

source: 편하게 말하라구~
en_us: go on, you can tell me!

source: 와락!
en_us: HUG

source: 킬킬
en_us: CACKLE

source: 구독자 47.5만
en_us: 475k subscribers

source: 거리에는 사람이 많은 만큼
en_us: the more people there are on the streets...
